Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: متاع قليل ولهم عذاب أليم
en: A passing brief enjoyment (will be theirs), but they will have a painful torment.

source: وعلى الذين هادوا حرمنا ما قصصنا عليك من قبل وما ظلمناهم ولكن كانوا أنفسهم يظلمون
en: And unto those who are Jews, We have forbidden such things as We have mentioned to you (O Muhammad صلى الله عليه و سلم) before [see Verse 6:146]. And We wronged them not, but they used to wrong themselves.

source: ثم إن ربك للذين عملوا السوء بجهالة ثم تابوا من بعد ذلك وأصلحوا إن ربك من بعدها لغفور رحيم
en: Then, verily! Your Lord - for those who do evil (commit sins and are disobedient to Allah) in ignorance and afterward repent and do righteous deeds, verily, your Lord thereafter, (to such) is Oft-Forgiving, Most Merciful.

source: إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين
en: Verily, Ibrahim (Abraham) was an Ummah (a leader having all the good righteous qualities), or a nation, obedient to Allah, Hanif (i.e. to worship none but Allah), and he was not one of those who were Al-Mushrikun (polytheists, idolaters, disbelievers in the Oneness of Allah, and those who joined partners with Allah).

source: شاكرا لأنعمه اجتباه وهداه إلى صراط مستقيم
en: (He was) thankful for His (Allah's) Favours. He (Allah) chose him (as an intimate friend) and guided him to a Straight Path (Islamic Monotheism - neither Judaism nor Christianity ).

source: وآتيناه في الدنيا حسنة وإنه في الآخرة لمن الصالحين
en: And We gave him good in this world, and in the Hereafter he shall be of the righteous.

source: ثم أوحينا إليك أن اتبع ملة إبراهيم حنيفا وما كان من المشركين
en: Then, We have sent the revelation to you (O Muhammad صلى الله عليه و سلم saying): "Follow the religion of Ibrahim (Abraham) Hanif (Islamic Monotheism - to worship none but Allah) and he was not of the Mushrikun (polytheists, idolaters and disbelievers).

source: إنما جعل السبت على الذين اختلفوا فيه وإن ربك ليحكم بينهم يوم القيامة فيما كانوا فيه يختلفون
en: The Sabbath was only prescribed for those who differed concerning it, and verily, your Lord will judge between them on the Day of Resurrection about that wherein they used to differ.

source: ادع إلى سبيل ربك بالحكمة والموعظة الحسنة وجادلهم بالتي هي أحسن إن ربك هو أعلم بمن ضل عن سبيله وهو أعلم بالمهتدين
en: Invite (mankind, O Muhammad صلى الله عليه و سلم) to the Way of your Lord (i.e. Islam) with wisdom (i.e. with the Divine Revelation and the Qur'an) and fair preaching, and argue with them in a way that is better. Truly, your Lord knows best who has gone astray from His Path, and He is the Best Aware of those who are guided.

source: وإن عاقبتم فعاقبوا بمثل ما عوقبتم به ولئن صبرتم لهو خير للصابرين
en: And if you punish (your enemy, O you believers in the Oneness of Allah), then punish them with the like of that with which you were afflicted. But if you endure patiently, verily, it is better for As-Sabirun (the patient).

source: واصبر وما صبرك إلا بالله ولا تحزن عليهم ولا تك في ضيق مما يمكرون
en: And endure you patiently (O Muhammad صلى الله عليه و سلم), your patience is not but from Allah. And grieve not over them (polytheists and pagans), and be not distressed because of what they plot.

source: إن الله مع الذين اتقوا والذين هم محسنون
en: Truly, Allah is with those who fear Him (keep their duty unto Him), and those who are Muhsinun (good-doers. See the footenote of V.9:120).

source: سبحان الذي أسرى بعبده ليلا من المسجد الحرام إلى المسجد الأقصى الذي باركنا حوله لنريه من آياتنا إنه هو السميع البصير
en: Glorified (and Exalted) be He (Allah) [above all that (evil) they associate with Him] Who took His slave (Muhammad صلى الله عليه و سلم) for a journey by night from Al-Masjid-al-Haram (at Makkah) to Al-Masjid-al-Aqsa (in Jerusalem), the neighbourhood whereof We have blessed, in order that We might show him (Muhammad صلى الله عليه و سلم) of Our Ayat (proofs, evidence, lessons, signs, etc.). Verily, He is the All-Hearer, the All-Seer .

source: وآتينا موسى الكتاب وجعلناه هدى لبني إسرائيل ألا تتخذوا من دوني وكيلا
en: And We gave Musa (Moses) the Scripture and made it a guidance for the Children of Israel (saying): "Take none other than Me as (your) Wakil (Protector, Lord or Disposer of your affairs).

source: ذرية من حملنا مع نوح إنه كان عبدا شكورا
en: "O offspring of those whom We carried (in the ship) with Nuh (Noah)! Verily, he was a grateful slave."

source: وقضينا إلى بني إسرائيل في الكتاب لتفسدن في الأرض مرتين ولتعلن علوا كبيرا
en: And We decreed for the Children of Israel in the Scripture: indeed you would do mischief in the land twice and you will become tyrants and extremely arrogant!

source: فإذا جاء وعد أولاهما بعثنا عليكم عبادا لنا أولي بأس شديد فجاسوا خلال الديار وكان وعدا مفعولا
en: So, when the promise came for the first of the two, We sent against you slaves of Ours given to terrible warfare. They entered the very innermost parts of your homes. And it was a promise (completely) fulfilled.

source: ثم رددنا لكم الكرة عليهم وأمددناكم بأموال وبنين وجعلناكم أكثر نفيرا
en: Then We gave you a return of victory over them. And We helped you with wealth and children and made you more numerous in man-power.

source: إن أحسنتم أحسنتم لأنفسكم وإن أسأتم فلها فإذا جاء وعد الآخرة ليسوءوا وجوهكم وليدخلوا المسجد كما دخلوه أول مرة وليتبروا ما علوا تتبيرا
en: (And We said): "If you do good, you do good for your ownselves, and if you do evil (you do it) against yourselves." Then, when the second promise came to pass, (We permitted your enemies) to disgrace your faces and to enter the mosque (of Jerusalem) as they had entered it before, and to destroy with utter destruction all that fell in their hands.

source: عسى ربكم أن يرحمكم وإن عدتم عدنا وجعلنا جهنم للكافرين حصيرا
en: [And We said in the Taurat (Torah)]: "It may be that your Lord may show mercy unto you, but if you return (to sins), We shall return (to Our Punishment). And We have made Hell a prison for the disbelievers.

source: إن هذا القرآن يهدي للتي هي أقوم ويبشر المؤمنين الذين يعملون الصالحات أن لهم أجرا كبيرا
en: Verily, this Qur'an guides to that which is most just and right and gives glad tidings to the believers (in the Oneness of Allah and His Messenger, Muhammad صلى الله عليه و سلم), who work deeds of righteousness, that they shall have a great reward (Paradise).

source: وأن الذين لا يؤمنون بالآخرة أعتدنا لهم عذابا أليما
en: And that those who believe not in the Hereafter, for them We have prepared a painful torment (Hell).

source: ويدع الإنسان بالشر دعاءه بالخير وكان الإنسان عجولا
en: And man invokes (Allah) for evil as he invokes (Allah) for good and man is ever hasty [i.e., if he is angry with somebody, he invokes (saying): "O Allah! Curse him" and that one should not do, but one should be patient].

source: وجعلنا الليل والنهار آيتين فمحونا آية الليل وجعلنا آية النهار مبصرة لتبتغوا فضلا من ربكم ولتعلموا عدد السنين والحساب وكل شيء فصلناه تفصيلا
en: And We have appointed the night and the day as two Ayat (signs etc.). Then, We have obliterated the sign of the night (with darkness) while We have made the sign of the day illuminating, that you may seek bounty from your Lord, and that you may know the number of the years and the reckoning. And We have explained everything (in detail) with full explanation.

source: وكل إنسان ألزمناه طائره في عنقه ونخرج له يوم القيامة كتابا يلقاه منشورا
en: And We have fastened every man's deeds to his neck, and on the Day of Resurrection, We shall bring out for him a book which he will find wide open.

source: اقرأ كتابك كفى بنفسك اليوم عليك حسيبا
en: (It will be said to him): "Read your book. You yourself are sufficient as a reckoner against you this Day."

source: من اهتدى فإنما يهتدي لنفسه ومن ضل فإنما يضل عليها ولا تزر وازرة وزر أخرى وما كنا معذبين حتى نبعث رسولا
en: Whoever goes right, then he goes right only for the benefit of his ownself. And whoever goes astray, then he goes astray to his own loss. No one laden with burdens can bear another's burden. And We never punish until We have sent a Messenger (to give warning).

source: وإذا أردنا أن نهلك قرية أمرنا مترفيها ففسقوا فيها فحق عليها القول فدمرناها تدميرا
en: And when We decide to destroy a town (population), We (first) send a definite order (to obey Allah and be righteous) to those among them [or We (first) increase in number those of its population] who lead a life of luxury. Then, they transgress therein, and thus the word (of torment) is justified against it (them). Then We destroy it with complete destruction.

source: وكم أهلكنا من القرون من بعد نوح وكفى بربك بذنوب عباده خبيرا بصيرا
en: And how many generations have We destroyed after Nuh (Noah)! And Sufficient is your Lord as an All-Knower and All-Beholder of the sins of His slaves.

source: من كان يريد العاجلة عجلنا له فيها ما نشاء لمن نريد ثم جعلنا له جهنم يصلاها مذموما مدحورا
en: Whoever desires the quick-passing (transitory enjoyment of this world), We readily grant him what We will for whom We like. Then, afterwards, We have appointed for him Hell; he will burn therein disgraced and rejected (- far away from Allah's Mercy).

source: ومن أراد الآخرة وسعى لها سعيها وهو مؤمن فأولئك كان سعيهم مشكورا
en: And whoever desires the Hereafter and strives for it, with the necessary effort due for it (i.e. does righteous deeds of Allah's Obedience) while he is a believer (in the Oneness of Allah - Islamic Monotheism) - then such are the ones whose striving shall be appreciated, (thanked and rewarded by Allah).

source: كلا نمد هؤلاء وهؤلاء من عطاء ربك وما كان عطاء ربك محظورا
en: On each - these as well as those - We bestow from the Bounties of your Lord. And the Bounties of your Lord can never be forbidden.

source: انظر كيف فضلنا بعضهم على بعض وللآخرة أكبر درجات وأكبر تفضيلا
en: See how We prefer one above another (in this world), and verily, the Hereafter will be greater in degrees and greater in preferment.

source: لا تجعل مع الله إلها آخر فتقعد مذموما مخذولا
en: Set not up with Allah any other ilah (god), (O man)! (This verse is addressed to Prophet Muhammad صلى الله عليه و سلم , but its implication is general to all mankind), or you will sit down reproved, forsaken (in the Hell-fire).

source: وقضى ربك ألا تعبدوا إلا إياه وبالوالدين إحسانا إما يبلغن عندك الكبر أحدهما أو كلاهما فلا تقل لهما أف ولا تنهرهما وقل لهما قولا كريما
en: And your Lord has decreed that you worship none but Him. And that you be dutiful to your parents. If one of them or both of them attain old age in your life, say not to them a word of disrespect, nor shout at them but address them in terms of honour.

source: واخفض لهما جناح الذل من الرحمة وقل رب ارحمهما كما ربياني صغيرا
en: And lower unto them the wing of submission and humility through mercy, and say: "My Lord! Bestow on them Your Mercy as they did bring me up when I was young."

source: ربكم أعلم بما في نفوسكم إن تكونوا صالحين فإنه كان للأوابين غفورا
en: Your Lord knows best what is in your inner-selves. If you are righteous, then, verily, He is Ever Most Forgiving to those who turn unto Him again and again in obedience, and in repentance.

source: وآت ذا القربى حقه والمسكين وابن السبيل ولا تبذر تبذيرا
en: And give to the kinsman his due and to the Miskin (poor) and to the wayfarer. But spend not wastefully (your wealth) in the manner of a spendthrift. (Tafsir At-Tabari)

source: إن المبذرين كانوا إخوان الشياطين وكان الشيطان لربه كفورا
en: Verily, the spendthrifts are brothers of the Shayatin (devils), and the Shaitan (Devil-Satan) is ever ungrateful to his Lord.

source: وإما تعرضن عنهم ابتغاء رحمة من ربك ترجوها فقل لهم قولا ميسورا
en: And if you (O Muhammad صلى الله عليه و سلم) turn away from them (kindred, poor, wayfarer whom We have ordered you to give their rights, but if you have no money at the time they ask you for it) and you are awaiting a mercy from your Lord for which you hope, then, speak unto them a soft kind word (i.e. Allah will give me and I shall give you).

source: ولا تجعل يدك مغلولة إلى عنقك ولا تبسطها كل البسط فتقعد ملوما محسورا
en: And let not your hand be tied (like a miser) to your neck, nor stretch it forth to its utmost reach (like a spendthrift), so that you become blameworthy and in severe poverty.

source: إن ربك يبسط الرزق لمن يشاء ويقدر إنه كان بعباده خبيرا بصيرا
en: Truly, your Lord enlarges the provision for whom He wills and straitens (for whom He wills). Verily, He is Ever All-Knower, All-Seer of His slaves.

source: ولا تقتلوا أولادكم خشية إملاق نحن نرزقهم وإياكم إن قتلهم كان خطئا كبيرا
en: And kill not your children for fear of poverty. We shall provide for them as well as for you. Surely, the killing of them is a great sin.

source: ولا تقربوا الزنا إنه كان فاحشة وساء سبيلا
en: And come not near to unlawful sex. Verily, it is a Fahishah (i.e. anything that transgresses its limits: a great sin), and an evil way (that leads one to Hell unless Allah forgives him).

source: ولا تقتلوا النفس التي حرم الله إلا بالحق ومن قتل مظلوما فقد جعلنا لوليه سلطانا فلا يسرف في القتل إنه كان منصورا
en: And do not kill anyone whose killing Allah has forbidden, except for a just cause. And whoever is killed wrongfully (Mazluman intentionally with hostility and oppression and not by mistake), We have given his heir the authority [to demand Qisas, - Law of Equality in punishment - or to forgive, or to take Diyah (blood money)]. But let him not exceed limits in the matter of taking life (i.e he should not kill except the killer). Verily, he is helped (by the Islamic law).

source: ولا تقربوا مال اليتيم إلا بالتي هي أحسن حتى يبلغ أشده وأوفوا بالعهد إن العهد كان مسئولا
en: And come not near to the orphan's property except to improve it, until he attains the age of full strength. And fulfil (every) covenant. Verily, the covenant, will be questioned about.

source: وأوفوا الكيل إذا كلتم وزنوا بالقسطاس المستقيم ذلك خير وأحسن تأويلا
en: And give full measure when you measure, and weigh with a balance that is straight. That is good (advantageous) and better in the end.

source: ولا تقف ما ليس لك به علم إن السمع والبصر والفؤاد كل أولئك كان عنه مسئولا
en: And follow not (O man i.e., say not, or do not or witness not) that of which you have no knowledge. Verily! The hearing, and the sight, and the heart, of each of those one will be questioned (by Allah).

source: ولا تمش في الأرض مرحا إنك لن تخرق الأرض ولن تبلغ الجبال طولا
en: And walk not on the earth with conceit and arrogance. Verily, you can neither rend nor penetrate the earth, nor can you attain a stature like the mountains in height.

source: كل ذلك كان سيئه عند ربك مكروها
en: All the bad aspects of these (the above mentioned things) are hateful to your Lord.

source: ذلك مما أوحى إليك ربك من الحكمة ولا تجعل مع الله إلها آخر فتلقى في جهنم ملوما مدحورا
en: This is (part) of Al-Hikmah (wisdom, good manners and high character) which your Lord has revealed to you (O Muhammad صلى الله عليه و سلم). And set not up with Allah any other ilah (god) lest you should be thrown into Hell, blameworthy and rejected, (from Allah's Mercy).

source: أفأصفاكم ربكم بالبنين واتخذ من الملائكة إناثا إنكم لتقولون قولا عظيما
en: Has then your Lord (O pagans of Makkah!) preferred for you sons, and taken for Himself from among the angels daughters? Verily you indeed utter an awful saying.

source: ولقد صرفنا في هذا القرآن ليذكروا وما يزيدهم إلا نفورا
en: And surely, We have explained [Our Promises, Warnings and (set forth many) examples] in this Qur'an that they (the disbelievers) may take heed, but it increases them in naught save aversion.

source: قل لو كان معه آلهة كما يقولون إذا لابتغوا إلى ذي العرش سبيلا
en: Say (O Muhammad صلى الله عليه و سلم to these polytheists, pagans): "If there had been other alihah (gods) along with Him as they assert, then they would certainly have sought out a way to the Lord of the Throne (seeking His Pleasures and to be near to Him).

source: سبحانه وتعالى عما يقولون علوا كبيرا
en: Glorified and Exalted be He! High above (the great falsehood) that they say! (i.e. forged statements that there are other gods along with Allah, but He is Allah, the One, the Self-Sufficient Master, Whom all creatures need. He begets not, nor was He begotten, and there is none comparable or coequal unto Him).

source: تسبح له السماوات السبع والأرض ومن فيهن وإن من شيء إلا يسبح بحمده ولكن لا تفقهون تسبيحهم إنه كان حليما غفورا
en: The seven heavens and the earth and all that is therein, glorify Him and there is not a thing but glorifies His Praise. But you understand not their glorification. Truly, He is Ever Forbearing, Oft-Forgiving.

source: وإذا قرأت القرآن جعلنا بينك وبين الذين لا يؤمنون بالآخرة حجابا مستورا
en: And when you (Muhammad صلى الله عليه و سلم) recite the Qur'an, We put between you and those who believe not in the Hereafter, an invisible veil (or screen their hearts, so they hear or understand it not).

source: وجعلنا على قلوبهم أكنة أن يفقهوه وفي آذانهم وقرا وإذا ذكرت ربك في القرآن وحده ولوا على أدبارهم نفورا
en: And We have put coverings over their hearts lest they should understand it (the Qur'an), and in their ears deafness. And when you make mention of your Lord Alone [La ilaha illallah (none has the right to be worshipped but Allah) Islamic Monotheism (توحيد الله)] in the Qur'an, they turn on their backs, fleeing in extreme dislike.

source: نحن أعلم بما يستمعون به إذ يستمعون إليك وإذ هم نجوى إذ يقول الظالمون إن تتبعون إلا رجلا مسحورا
en: We know best of what they listen to, when they listen to you. And when they take secret counsel, then the Zalimun (polytheists and wrong-doers) say: "You follow none but a bewitched man."

source: انظر كيف ضربوا لك الأمثال فضلوا فلا يستطيعون سبيلا
en: See what examples they have put forward for you. So they have gone astray, and never can they find a way.

source: وقالوا أإذا كنا عظاما ورفاتا أإنا لمبعوثون خلقا جديدا
en: And they say: "When we are bones and fragments (destroyed), should we really be resurrected (to be) a new creation?"

source: قل كونوا حجارة أو حديدا
en: Say (O Muhammad صلى الله عليه و سلم) "Be you stones or iron,"

source: أو خلقا مما يكبر في صدوركم فسيقولون من يعيدنا قل الذي فطركم أول مرة فسينغضون إليك رءوسهم ويقولون متى هو قل عسى أن يكون قريبا
en: "Or some created thing that is yet greater (or harder) in your breasts (thoughts to be resurrected, even then you shall be resurrected)." Then, they will say: "Who shall bring us back (to life)?" Say: "He Who created you first!" Then, they will shake their heads at you and say: "When will that be?" Say: "Perhaps it is near!"

source: يوم يدعوكم فتستجيبون بحمده وتظنون إن لبثتم إلا قليلا
en: On the Day when He will call you, and you will answer (His Call) with (words of) His Praise and Obedience, and you will think that you have stayed (in this world) but a little while!

source: وقل لعبادي يقولوا التي هي أحسن إن الشيطان ينزغ بينهم إن الشيطان كان للإنسان عدوا مبينا
en: And say to My slaves (i.e. the true believers of Islamic Monotheism) that they should (only) say those words that are the best. (Because) Shaitan (Satan) verily, sows a state of conflict and disagreements among them. Surely, Shaitan (Satan) is to man a plain enemy.

source: ربكم أعلم بكم إن يشأ يرحمكم أو إن يشأ يعذبكم وما أرسلناك عليهم وكيلا
en: Your Lord knows you best; if He wills, He will have mercy on you, or if He wills, He will punish you. And We have not sent you (O Muhammad صلى الله عليه و سلم) as a guardian over them.

source: وربك أعلم بمن في السماوات والأرض ولقد فضلنا بعض النبيين على بعض وآتينا داوود زبورا
en: And your Lord knows best all who are in the heavens and the earth. And indeed, We have preferred some of the Prophets above others, and to Dawud (David) We gave the Zabur (Psalms).

source: قل ادعوا الذين زعمتم من دونه فلا يملكون كشف الضر عنكم ولا تحويلا
en: Say (O Muhammad صلى الله عليه و سلم): "Call upon those - besides Him - whom you pretend [to be gods like angels, 'Îsa (Jesus), 'Uzair (Ezra), and others.]. They have neither the power to remove the adversity from you nor even to shift it from you to another person."

source: أولئك الذين يدعون يبتغون إلى ربهم الوسيلة أيهم أقرب ويرجون رحمته ويخافون عذابه إن عذاب ربك كان محذورا
en: Those whom they call upon [like 'Îsa (Jesus) - son of Maryam (Mary), 'Uzair (Ezra), angel] desire (for themselves) means of access to their Lord (Allah), as to which of them should be the nearest; and they ['Îsa (Jesus), 'Uzair (Ezra), angels and others] hope for His Mercy and fear His Torment. Verily, the Torment of your Lord is (something) to be afraid of!

source: وإن من قرية إلا نحن مهلكوها قبل يوم القيامة أو معذبوها عذابا شديدا كان ذلك في الكتاب مسطورا
en: And there is not a town (population) but We shall destroy it before the Day of Resurrection, or punish it with a severe torment. That is written in the Book (of Our Decrees)

source: وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون وآتينا ثمود الناقة مبصرة فظلموا بها وما نرسل بالآيات إلا تخويفا
en: And nothing stops Us from sending the Ayat (proofs, evidence, signs) but that the people of old denied them. And We sent the she-camel to Thamud as a clear sign, but they did her wrong. And We sent not the signs except to warn, and to make them afraid (of destruction).

source: وإذ قلنا لك إن ربك أحاط بالناس وما جعلنا الرؤيا التي أريناك إلا فتنة للناس والشجرة الملعونة في القرآن ونخوفهم فما يزيدهم إلا طغيانا كبيرا
en: And (remember) when We told you: "Verily! Your Lord has encompassed mankind (i.e. they are in His Grip)." And We made not the vision which we showed you (O Muhammad as an actual eye-witness and not as a dream on the night of Al-Isra' ) but a trial for mankind, and (likewise) the accursed tree (Zaqqum, mentioned) in the Qur'an. We warn and make them afraid but it only increases them in naught save great disbelief, oppression and disobedience to Allah.

source: وإذ قلنا للملائكة اسجدوا لآدم فسجدوا إلا إبليس قال أأسجد لمن خلقت طينا
en: And (remember) when We said to the angels: "Prostrate yourselves unto Adam." They prostrated themselves except Iblis (Satan). He said: "Shall I prostrate myself to one whom You created from clay?"

source: قال أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا
en: [Iblis (Satan)] said: "See this one whom You have honoured above me, if You give me respite (keep me alive) to the Day of Resurrection, I will surely seize and mislead his offspring (by sending them astray) all but a few!"

source: قال اذهب فمن تبعك منهم فإن جهنم جزاؤكم جزاء موفورا
en: (Allah) said: "Go, and whosoever of them follows you, surely Hell will be the recompense of you (all) - an ample recompense.

source: واستفزز من استطعت منهم بصوتك وأجلب عليهم بخيلك ورجلك وشاركهم في الأموال والأولاد وعدهم وما يعدهم الشيطان إلا غرورا
en: "And befool them gradually those whom you can among them with your voice (i.e. songs, music, and any other call for Allah's disobedience), make assaults on them with your cavalry and your infantry, share with them wealth and children (by tempting them to earn money by illegal ways - usury, or by committing illegal sexual intercourse), and make promises to them." But Satan promises them nothing but deceit.

source: إن عبادي ليس لك عليهم سلطان وكفى بربك وكيلا
en: "Verily, My slaves (i.e. the true believers of Islamic Monotheism) - you have no authority over them. And All-Sufficient is your Lord as a Guardian."

source: ربكم الذي يزجي لكم الفلك في البحر لتبتغوا من فضله إنه كان بكم رحيما
en: Your Lord is He Who drives the ship for you through the sea, in order that you may seek of His Bounty. Truly He is Ever Most Merciful towards you.

source: وإذا مسكم الضر في البحر ضل من تدعون إلا إياه فلما نجاكم إلى البر أعرضتم وكان الإنسان كفورا
en: And when harm touches you upon the sea, those that you call upon vanish from you except Him (Allah Alone). But when He brings you safe to land, you turn away (from Him). And man is ever ungrateful .
